---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.DocumentSavingEventArgs
source: html/64b23f00-b374-b8ad-e27a-051f07b44f71.htm
---
# DocumentSavingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.